#### SpatialElementType Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing types of spaces.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public enum SpatialElementType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration SpatialElementType ``` |

| Visual C++ |
| --- |
| ``` public enum class SpatialElementType ``` |

# Members

| Member name | Description |
| --- | --- |
| Room | Room |
| Area | Area |
| Space | Space |
| ElectricalLoadArea | Electrical Load Area |

# See Also

Autodesk.Revit.DB Namespace